
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область Нетология_Доработка
&НаСервере
Процедура ПрограммноеДобавлениеЭлементовНаФорму()
	
	//Добавили реквизит формы "Контактное лицо"
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизитКЛ = Новый РеквизитФормы("НТЯ_КонтактноеЛицо", Новый ОписаниеТипов("СправочникСсылка.НТЯ_КонтактныеЛица"));	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитКЛ);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Вынесли реквизит "Контактное лицо" на форму
	ЭлементФормыКЛ = Элементы.Добавить("НТЯ_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	ЭлементФормыКЛ.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормыКЛ.Заголовок = "Контактное лицо";
	ЭлементФормыКЛ.ПутьКДанным = "НТЯ_КонтактноеЛицо";
	// ---Устанавливаем связь по владельцу для Контактных лиц---\\
	СвязьПоВладельцу = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассивДляСвязи = Новый Массив();
	НовыйМассивДляСвязи.Добавить(СвязьПоВладельцу);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассивДляСвязи);
	ЭлементФормыКЛ.СвязиПараметровВыбора = НовыеСвязи;	
	 	
	
	//Добавили реквизит формы "Согласованная скидка"
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизитСкидка = Новый РеквизитФормы("НТЯ_СогласованнаяСкидка", Новый ОписаниеТипов("Число"));	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитСкидка);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Вынесли реквизит "Согласованная скидка" на форму
	ЭлементФормыСкидка = Элементы.Добавить("НТЯ_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
	ЭлементФормыСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормыСкидка.Заголовок = "Согласованная скидка";
	ЭлементФормыСкидка.ПутьКДанным = "НТЯ_СогласованнаяСкидка"; 
	ЭлементФормыСкидка.УстановитьДействие("ПриИзменении", "НТЯ_НТЯ_СогласованнаяСкидкаПриИзмененииПосле");
	//ЭлементФормыСкидка.УстановитьДействие("ПриИзменении", "НТЯ_ПересчитатьСУчетомВведеннойСкидки");
	
	//Добавили команду "Пересчет суммы с учетом скидки" на форму
	НоваяКоманда = Команды.Добавить("НТЯ_ПересчетСуммыСУчетомСкидки");
	НоваяКоманда.Заголовок = "Пересчитать с учетом скидки";
	НоваяКоманда.Действие = "НТЯ_ПересчитатьСУчетомВведеннойСкидки";
	
	//Вынесли команду "Пересчет суммы с учетом скидки" на форму
	ЭлементФормыСкидка = Элементы.Добавить("НТЯ_ПересчитатьСУчетомВведеннойСкидки", Тип("КнопкаФормы"), Элементы.ГруппаШапкаЛево);
	ЭлементФормыСкидка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	ЭлементФормыСкидка.ИмяКоманды = "НТЯ_ПересчетСуммыСУчетомСкидки";
	
КонецПроцедуры
#КонецОбласти


#Область Нетология_Доработка_Команда

&НаКлиенте
Процедура НТЯ_ПересчитатьСУчетомВведеннойСкидки(Команда)
	РассчитатьСуммыСтрокВТаблицахТоварыИУслуги();	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыСтрокВТаблицахТоварыИУслуги()
	
	Для Каждого ТекСтрокаТовары Из Объект.Товары Цикл
		ПересчетСуммыВТаблицах(ТекСтрокаТовары);
	КонецЦикла;
	
	Для Каждого ТекСтокаУслуги Из Объект.Услуги Цикл
		ПересчетСуммыВТаблицах(ТекСтокаУслуги);
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыВТаблицах(Строка)    
	
	//@skip-check Undefined variable
	Строка.Сумма = (Строка.Цена * Строка.Количество) - (Строка.Цена * Строка.Количество) * НТЯ_СогласованнаяСкидка / 100;

КонецПроцедуры

&НаКлиенте
Процедура НТЯ_НТЯ_СогласованнаяСкидкаПриИзмененииПосле(Элемент)
		
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Изменить суммы в таблицах Товаров и Услуг с учетом введённой скидки?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да, "Подтвердите операцию");
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        РассчитатьСуммыСтрокВТаблицахТоварыИУслуги();
	Иначе
		Возврат;
	КонецЕсли;	
 
КонецПроцедуры

#КонецОбласти
